# LinetypesFileName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..LinetypesFileName Property
ACADExportOptions Class See Also
---
The custom linetype file name (*.lin). Default value is empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string LinetypesFileName { get; set; }
```

Visual Basic
---
```text
Public Property LinetypesFileName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ LinetypesFileName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace